#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/imagebuilder/imagebuilder-staging/runs/run-JMDLCisYQeG8xUAX

Waiting for the plan to start...

Terraform v0.14.0
Configuring remote state backend...
Initializing Terraform configuration...
aws_s3_bucket.imagebuilder_s3: Refreshing state... [id=imagebuilder.service.staging]
aws_cloudwatch_log_group.internal_composer: Refreshing state... [id=internal_composer_staging]
aws_iam_user.imagebuilder_worker: Refreshing state... [id=imagebuilder_worker_staging]
aws_iam_user.packer: Refreshing state... [id=packer_staging]
aws_iam_policy.vmimport_s3: Refreshing state... [id=arn:aws:iam::933752197999:policy/vmimport_s3_staging]
aws_iam_role.vmimport: Refreshing state... [id=vmimport_staging]
aws_iam_role.internal_worker: Refreshing state... [id=internal_worker_staging]
aws_iam_role.internal_composer: Refreshing state... [id=internal_composer_staging]
aws_iam_policy.packer: Refreshing state... [id=arn:aws:iam::933752197999:policy/packer_staging]
aws_iam_policy.vmimport_ec2: Refreshing state... [id=arn:aws:iam::933752197999:policy/vmimport_ec2_staging]
aws_iam_role.spot_fleet_tagging_role: Refreshing state... [id=imagebuilder_spot_fleet_role_staging]
aws_iam_policy.spotfleet_iam_spot_policy: Refreshing state... [id=arn:aws:iam::933752197999:policy/spotfleet_iam_spot_policy_staging]
aws_cloudwatch_log_stream.internal_composer_syslog: Refreshing state... [id=internal_composer_syslog]
aws_iam_role_policy_attachment.vmimport_s3: Refreshing state... [id=vmimport_staging-20201204204656723700000009]
aws_iam_instance_profile.internal_worker: Refreshing state... [id=internal_worker_staging]
aws_iam_policy.internal_composer_read_keys: Refreshing state... [id=arn:aws:iam::933752197999:policy/internal_composer_read_keys_staging]
aws_iam_instance_profile.internal_composer: Refreshing state... [id=internal_composer_staging]
aws_iam_policy.internal_worker_read_keys: Refreshing state... [id=arn:aws:iam::933752197999:policy/internal_worker_read_keys_staging]
aws_iam_role_policy_attachment.spotfleet_iam_role_policy: Refreshing state... [id=imagebuilder_spot_fleet_role_staging-20201204204656385800000003]
aws_iam_user_policy_attachment.packer: Refreshing state... [id=packer_staging-20201204204656365500000001]
aws_iam_role_policy_attachment.vmimport_ec2: Refreshing state... [id=vmimport_staging-20201204204656576600000006]
aws_iam_user_policy_attachment.imagebuilder_vmimport: Refreshing state... [id=imagebuilder_worker_staging-20201204204656609900000007]
aws_iam_policy.internal_cloudwatch_logging: Refreshing state... [id=arn:aws:iam::933752197999:policy/internal_cloudwatch_logging_staging]
aws_iam_role_policy_attachment.spotfleet_iam_spot_policy: Refreshing state... [id=imagebuilder_spot_fleet_role_staging-20201204204656553800000004]
aws_vpc_endpoint.internal_vpc_s3: Refreshing state... [id=vpce-08d5fdb7cd26e5c94]
aws_security_group.internal_allow_egress: Refreshing state... [id=sg-0eb65fd8f2c17dba5]
aws_security_group.internal_allow_trusted: Refreshing state... [id=sg-084607083aaa39727]
aws_vpc_endpoint.external_vpc_s3: Refreshing state... [id=vpce-0249da6b762fae5de]
aws_security_group.allow_ssh: Refreshing state... [id=sg-006ce6110566350f2]
aws_security_group.allow_cockpit: Refreshing state... [id=sg-09158a308f058582a]
aws_security_group.allow_egress: Refreshing state... [id=sg-01bbbcc6e5692161b]
aws_security_group.allow_icmp: Refreshing state... [id=sg-08e7ed5aa3caa810e]
aws_iam_role_policy_attachment.internal_worker_read_keys: Refreshing state... [id=internal_worker_staging-20201204204656366800000002]
aws_iam_role_policy_attachment.internal_cloudwatch_composer: Refreshing state... [id=internal_worker_staging-2020120420465704850000000b]
aws_iam_role_policy_attachment.internal_composer_read_keys: Refreshing state... [id=internal_composer_staging-20201204204656559200000005]
aws_iam_role_policy_attachment.internal_cloudwatch_worker: Refreshing state... [id=internal_composer_staging-2020120420465704340000000a]
aws_launch_template.worker_x86: Refreshing state... [id=lt-02c4ef76cd0a29529]
aws_network_interface.composer_internal: Refreshing state... [id=eni-07088640399f60f49]
aws_ebs_volume.composer_internal: Refreshing state... [id=vol-058d1cec56397f102]
aws_spot_fleet_request.imagebuilder_worker_x86: Refreshing state... [id=sfr-28456c4c-dc0f-496d-a24c-e13e881d94ba]
aws_instance.composer_internal: Refreshing state... [id=i-0d6d52766e8d4f91d]
aws_iam_policy.imagebuilder_workers_s3: Refreshing state... [id=arn:aws:iam::933752197999:policy/imagebuilder_workers_s3_staging]
aws_iam_user_policy_attachment.imagebuilder_s3: Refreshing state... [id=imagebuilder_worker_staging-2020120420465705150000000c]
aws_volume_attachment.composer_internal: Refreshing state... [id=vai-372124328]
aws_launch_template.worker_internal_x86: Refreshing state... [id=lt-0aae9d85fdd3f7067]
aws_spot_fleet_request.workers_internal_x86: Refreshing state... [id=sfr-c9d09a9c-c9aa-4089-bbdc-91b6a9746395]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_vpc_endpoint.external_vpc_cloudwatch_logs will be created
  + resource "aws_vpc_endpoint" "external_vpc_cloudwatch_logs" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = true
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.us-east-1.logs"
      + state                 = (known after apply)
      + subnet_ids            = (known after apply)
      + tags                  = {
          + "AppCode"      = "IMGB-001"
          + "Name"         = "Image Builder CloudWatch Logs VPC endpoint"
          + "ServiceOwner" = "Image Builder"
        }
      + vpc_endpoint_type     = "Gateway"
      + vpc_id                = "vpc-78468405"
    }

  # aws_vpc_endpoint.internal_vpc_cloudwatch_logs will be created
  + resource "aws_vpc_endpoint" "internal_vpc_cloudwatch_logs" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = true
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.us-east-1.logs"
      + state                 = (known after apply)
      + subnet_ids            = (known after apply)
      + tags                  = {
          + "AppCode"      = "IMGB-001"
          + "Name"         = "Image Builder CloudWatch Logs VPC endpoint"
          + "ServiceOwner" = "Image Builder"
        }
      + vpc_endpoint_type     = "Gateway"
      + vpc_id                = "vpc-06d6127910664367d"
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```

</details>

*Pusher: @ondrejbudai, Action: `pull_request`*